//================================================================================
//      FILE
//--------------------------------------------------------------------------------
//--------------------------------------------------------------------------------
//      ファイル名      :       bmpt.c
//      概要            :       BMP形式画像を扱うライブラリのテストプログラム
//--------------------------------------------------------------------------------
#include <stdio.h>
#include "bmp.h"

int main(void)
{
	FILE *fp1;
	FILE *fp2;
	BMP *bmp;

	fp1 = fopen("./img/test.bmp", "r");
	fp2 = fopen("./img/testo.bmp", "w");

	bmp = read_bmp(fp1);
	write_bmp(fp2, bmp);

	/*
	 * TODO: segmentation fault
	 */
	close_bmp(bmp);

	return 0;
}
